papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/cavityFlexibleBottom/base/quasiMonolithic/0/fluid/inlet.parabolic
type            parabolicVelocity;
maxValue        1.5;
n               (1 0 0);
y               (0 1 0);
value           uniform (0 0 0);