papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/cavityFlexibleBottom/base/quasiMonolithic/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 6;

method          scotch;

monolithicCoeffs
{
    regions (fluid solid);

    // Optional per-region cell weights
    // DOF-based: fluid has 4 DOFs/cell (p,Ux,Uy,Uz), solid has 3 (Dx,Dy,Dz)
    regionWeights
    {
        fluid   3;
        solid   2;
    }

    interfaces
    (
        {
            regionA     fluid;
            patchA      interface;
            regionB     solid;
            patchB      interface;
        }
    );
}

// ************************************************************************* //
